app/Controllers/Admin.php

    public function gestionar_usuarios()
    {
        $usuarioModel = new usuario_model();
        $usuarios = $usuarioModel->orderBy('id_usuario', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` DESC

    public function gestionar_productos()
    {
        $productoModel = new \App\Models\Producto_model();
        $categoriaModel = new \App\Models\Categoria_model();

        // Obtener productos sin duplicados
        $productos = $productoModel->getProductosParaAdmin();

        // Obtener categorías activas
        $categorias = $categoriaModel->where('activacion', 1)->findAll();
---
SELECT *
FROM `categoria`
WHERE `activacion` = 1

    public function gestionar_consultas()
    {
        if (!session()->get('usuario_logueado') || session()->get('perfil_id') != 1) {
            return redirect()->to('login')->with('error', 'No tienes permisos de administrador');
        }

        try {
            $consultaModel = new Consulta_model();
            $consultas = $consultaModel->orderBy('fecha', 'DESC')->findAll();
---
SELECT *
FROM `consultas`
ORDER BY `fecha` DESC

    public function editar_producto()
{
    $productoModel = new \App\Models\Producto_model();
    $stockModel = new \App\Models\ProductoTalle_model();

    $id = $this->request->getPost('id');

    $producto = $productoModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '9'

    ];

    try {
        $productoModel->update($id, $dataUpdate);
---
UPDATE `productos` SET `nombre` = 'BVB 2013 - REUS', `precio` = '25600.00', `descripcion` = 'a', `id_categoria` = '1', `imagen` = 'cretro9.png'
WHERE `productos`.`id` IN ('9')