app/Controllers/Admin.php

SELECT *
FROM `ventas`
ORDER BY `fecha` DESC
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '20'
---
    public function gestionar_ventas()
    {
        $ventaModel = new \App\Models\Venta_model();
        $detalleModel = new \App\Models\Detalle_venta_model();
        $usuarioModel = new \App\Models\Usuario_model();

        $ventas = $ventaModel->orderBy('fecha', 'DESC')->findAll();

        foreach ($ventas as &$venta) {
            $venta['usuario'] = $usuarioModel->find($venta['id_usuario']);