app/Controllers/Carrito_controller.php

INSERT INTO `ventas` (`id_usuario`, `fecha`, `total`) VALUES ('20', '2025-06-24 08:54:17', 22000)
---
            ];
            $libros->update($item['id'], $data);

            $detalle->insert($detalle_venta);