app/Controllers/Producto_controller.php

SELECT *
FROM `categoria`
SELECT *
FROM `productos`
WHERE `activo` = 1
AND `id_categoria` = '4'
---
    public function catalogo()
    {
        $categoriaId = $this->request->getGet('categoria');
        $productoModel = new \App\Models\Producto_model();
        $categoriaModel = new \App\Models\Categoria_model();

        // Obtener todas las categorías
        $categorias = $categoriaModel->findAll();

        // Obtener productos según la categoría seleccionada
        if ($categoriaId) {
            $productos = $productoModel->where('activo', 1)->where('id_categoria', $categoriaId)->findAll();