app/Controllers/Usuario.php

    public function login()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'El email es obligatorio',
                    'valid_email' => 'Debe ser un email válido'
                ]
            ],
            'contraseña' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'La contraseña es obligatoria'
                ]
            ]
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return view('plantillas/header') .
                   view('login', ['validation' => $validation]) .
                   view('plantillas/footer');
        }

        $usuarioModel = new \App\Models\Usuario_model();
        $email = trim(strtolower($this->request->getPost('email')));
        $contraseña = $this->request->getPost('contraseña');

        $usuario = $usuarioModel->where('email', $email)
                               ->where('baja', 'NO')
                               ->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'gastonfernandez2015.gf@gmail.com'
AND `baja` = 'NO'
 LIMIT 1

    public function perfil()
    {
        // Verificar que el usuario esté logueado
        if (!session()->get('usuario_logueado')) {
            return redirect()->to('login');
        }

        $usuarioModel = new usuario_model();
        $usuario_id = session()->get('usuario_id');

        // Obtener datos actuales del usuario
        $usuario = $usuarioModel->find($usuario_id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '20'

        }

        try {
            $resultado = $usuarioModel->update($usuario_id, $data_update);
---
UPDATE `usuarios` SET `nombre` = 'Octavioo', `apellido` = 'Fernandez', `email` = 'gastonfernandez2022.gf@gmail.com'
WHERE `usuarios`.`id_usuario` IN ('20')