app/Models/Producto_model.php

    public function getProductosConCategoria()
    {
        return $this->select('productos.*, categoria.ct_nombre as categoria_nombre')
                    ->join('categoria', 'categoria.id_categoria = productos.id_categoria', 'left')
                    ->where('productos.activo', 1)
                    ->findAll();
---
SELECT `productos`.*, `categoria`.`ct_nombre` as `categoria_nombre`
FROM `productos`
LEFT JOIN `categoria` ON `categoria`.`id_categoria` = `productos`.`id_categoria`
WHERE `productos`.`activo` = 1

public function getProductosParaAdmin()
{
    // SIMPLE: Sin JOINs complicados que causen duplicados
    return $this->select('productos.*, categoria.ct_nombre as categoria_nombre')
                ->join('categoria', 'categoria.id_categoria = productos.id_categoria', 'left')
                ->orderBy('productos.activo', 'DESC')
                ->orderBy('productos.nombre', 'ASC')
                ->findAll();
---
SELECT `productos`.*, `categoria`.`ct_nombre` as `categoria_nombre`
FROM `productos`
LEFT JOIN `categoria` ON `categoria`.`id_categoria` = `productos`.`id_categoria`
ORDER BY `productos`.`activo` DESC, `productos`.`nombre` ASC

    public function toggleActivo($id)
    {
        $producto = $this->find($id);
        if ($producto) {
            $nuevoEstado = $producto['activo'] == 1 ? 0 : 1;
            return $this->update($id, ['activo' => $nuevoEstado]);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '6'
UPDATE `productos` SET `activo` = 0
WHERE `productos`.`id` IN ('6')