app/Models/ProductoStock_model.php

SELECT *
FROM `producto_stock`
WHERE `producto_id` = '1'
ORDER BY `talle` ASC
---
    public function getStockPorProducto($producto_id)
    {
        return $this->where('producto_id', $producto_id)
                    ->orderBy('talle', 'ASC')
                    ->findAll();