app/Models/ProductoTalle_model.php

SELECT *
FROM `producto_talle`
WHERE `producto_id` = '1'
AND `talle` != ''
AND `talle` IS NOT NULL
ORDER BY `talle` ASC
---
    public function getStockPorProducto($producto_id)
    {
        return $this->where('producto_id', $producto_id)
                    ->where('talle !=', '') // Excluir talles vacíos
                    ->where('talle IS NOT', null) // Excluir talles nulos
                    ->orderBy('talle', 'ASC')
                    ->findAll();